Tekla.Structures.Drawing.DrawingUpToDateStatus
The drawing up to date status.

Tekla.Structures.Drawing.DrawingUpToDateStatus.DrawingIsUpToDate
The drawing is up to date.

Tekla.Structures.Drawing.DrawingUpToDateStatus.PartsWereModified
Some parts in the drawing were modified since the last update.

Tekla.Structures.Drawing.DrawingUpToDateStatus.DrawingIsUpToDateButMayNeedChecking
The drawing is up to date but may need checking.

Tekla.Structures.Drawing.DrawingUpToDateStatus.IncludedDrawingModified
The included drawing was modified.

Tekla.Structures.Drawing.DrawingUpToDateStatus.OriginalPartDeleted
The original part from which the drawing was created was deleted since the last update.

Tekla.Structures.Drawing.DrawingUpToDateStatus.AllPartsDeleted
All parts were deleted.

Tekla.Structures.Drawing.DrawingUpToDateStatus.NumberOfPartsInNumberingSeriesIncreased
The number of parts in the numbering series has increased since the last update.

Tekla.Structures.Drawing.DrawingUpToDateStatus.NumberOfPartsInNumberingSeriesDecreased
The number of parts in the numbering series has decreased since the last update.

Tekla.Structures.Drawing.DrawingUpToDateStatus.DrawingWasCloned
The drawing was cloned from another drawing.

Tekla.Structures.Drawing.DrawingUpToDateStatus.DrawingWasUpdated
The drawing was updated.

Tekla.Structures.Drawing.DrawingUpToDateStatus.CopiedViewChanged
The copied view changed.

Tekla.Structures.Drawing.DrawingUpToDateStatus.DrawingWasSplitted
The drawing was splitted (cloned) during numbering.

Tekla.Structures.Drawing.DrawingUpToDateStatus.MovedViewDeleted
The moved view was deleted.

Tekla.Structures.Drawing.DrawingUpToDateStatus.MovedViewLabelChanged
The moved view symbol has changed.

Tekla.Structures.Drawing.DrawingUpToDateStatus.DrawingWasClonedFromCloud
The drawing was cloned from another drawing in cloud service.